install.packages("combinat") #пакет, който позволява използването на комбинаторни конфигурации

rm(list = ls()) #освобождаване (изтриване) на всички създадени променливи и инстанции

# Стойностите на факултетния номер - 71923
A <- 9 # 2 < 3 => 2 + 7 = 9
B <- 3
C <- 2 * A + B

# Случайна величина X - брой клиенти - матрицата ще държи разпределението на Х 
X <- matrix(c(seq(1, 3*C), rep(0, 3*C)), nrow = 2, ncol = 63, byrow = TRUE)

p <- (A+3)/(A+5) #вероятността клиент да си купи торбичка

# Биномно разпределение
for(x in X) #с цикъла обхождаме стойностите на Х и изчисляваме вероятността на всяка от тях
{
  X[2, x] <- choose(3*C, x) * (p ** x) * ((1 - p) ** (3*C - x)) #choose(3*C, x) => комбинация 3*С елемента х-ти клас
                                                                #p ** x => p^x
                                                                #(1 - p) ** (3*c - x) => q ^ (3*c - x)
}

#Проверка за разпределението - дали сбора от вероятностите на всички стойности на сл.в. Х е 1
sum <- 0
for(x in 1:(3*C))
{
  sum <- sum + X[2, x]
}
sum == 1 #ако условието е вярно, то разпределението е правилно

#Сметки - за да е < n >= 0,9 събираме докато не стане 0.9
sumElems <- 0 #парциалната сума
coef <- 0 #индексът при който парциалната сума става >= 0.9
for(x in 1:(3*C))
{
  if(sumElems >= 0.9) #проверка дали сме 
  {
    coef <- x+1 #тъй като търсим n което е > от {Х = х}
    break #когато открием елемента продължаваме да увеличаваме броя на членовете в парциалната сума
  }
  else
  {
    sumElems <- sumElems + X[2, x]
  }
}

sumElems #0.9022714 - сумата на елементите до 58-ия
coef #59 - след като първите 58 елемента имат сума на вероятностите >= 0.9, най-малкото n ще бъде 59
